{
  "Anthracnose": ["Mango anthracnose is caused by the fungus Colletotrichum gloeosporioides var minor (also known by the name of its perfect stage Glomerella cingulata var minor). Spore production by this fungus is favoured by wet or humid weather. The dispersal of these spores is particularly favoured by rain and wind.",
"•  The fungus attacks tender shoots and foliage.\n•  Brown or dark circular or irregular spots are formed on the leaves and such leaves are crinkled.\n•  The affected portion dry up and fall off and leaf ragged margins.\n•  Often these leaves are shed leaving the twigs bare.\n•  The infection spreads to the green twigs and forms dark brown lesions on them.\n•  Young branches dieback.\n•  On the lesions and dead portions, minute, pink, cushion-shaped fructifications of the pathogen are seen during moist weather.\n• Small dark spots are formed on the main stalk and lateral branches of the panicle.\n•  Individual flower stalks are also infected.\n•  The flowers wither and shed.\n•  When severely infected.\n•  All the flowers destroyed and no fruits are formed.\n• The tender fruits turn black and fall off.\n•  Often dark lesions develop on the fruits and cause partial of complete shriveling, blackening and shedding.\n•  Matured fruits are also infected.\n•  Black, round or irregular, sunken spots are formed on the skin.\n•  as the fruit ripens the spots extend over the whole surface accompanied by the softening and rotting of the fruits.\n•  This type of injury is observed while the fruits are on the trees.\n•  it also occurs during transit and in storage.\n•  Spoilage of ripen fruits is common.\n•  Fructification of the pathogen is formed on the spots.",
"•  Inoculum remains on dried leaves, defoliated branches, mummified flowers and flower brackets and they serve as primary inoculum.\n•  Secondary spread is through air born conidia.\n•  The fungus can enter the pores of green fruits.\n•  The latent infection of mature fruits may takes place through lenticels.\n•  The fungus apparently infects the fruit while it is green and develops in flesh during ripening.\n•  The latent infection is carried from the field to storage.\n•  Healthy fruits develop infection after in coming in contact with disease ones.\n•  The latent infection does not begin to spread until it reaches eating maturity.",
"•  Diseased twigs, leaves and fruits, which fall on the ground in the orchard, should be collected and all infected twigs should be pruned and burnt.\n•  Spraying of Bordeaux mixture 0.6% in the young plants during Feb, April and sept controls the disease.\n•  Spraying carbendazim 0.\n• 1% or thiophanate-methyl0.\n• 1% or chlorothalonil 0.2% for 15days interval until harvest effectively controls anthracnose.\n•  Before storage, fruits should be treated with hot water at 50-550 c for 15min.\n•  or thiabendazone 1000ppm for 5min.\n•  Spraying of coc +zineb after completion of heavy showers followed by wettable sulphur 0.\n• 2% before flowering and carbendazin 0.\n• 1% at 15days interval from fruits formation proved effective."],
    "Bacterial Canker": ["Mango bacterial canker disease, caused by Xanthomonas campestris pv. mangiferaeindicae, has become increasingly important in the Kakori and Malihabad mango belt of India. In this area disease appeared during Jun.",
"•  The disease attacks the leaves, leaf stalks, stem and fruits.\n• On the leaves disease first manifests itself as minute, water soaked irregular lesions, black and is surrounded by chloratic haloes.\n•  Due to vein limitations the spots become angular and result in cankerous patches, which sometime dry up. Sever infection results in defoliation.\n•  The bacteria also infects the fruits first showing water soaked lesions, which later become dark brown to black and causes sever cracking of fruits, accompanied by heavy bacterial exudation.\n•  There may be only a few lesions on each fruit but more lesions on tender fruits may lead to sever fruit drop.\n•  On branches on twigs the lesions become raised with longitudinal fissures, and are accompanied by the bacterial gummy ooze.",
"•  Infected nursery trees have been a major source of BBS in new orchardsBacterium enters the leaf through stomata and lenticels in fruit and through lenticels in twigs.\n•  The bacterium survives in infected parts on the tree.\n•  The pathogen survives up to 8months in the leaves.\n•  Bacteria from cankers on the twigs are the cause for primary infection on the fruits.\n•  Disease spread is rapid during rainy days. Disease spread to the new area through infected planting material.\n•  When fruits are found in bunches disease spreads when they contact each other.",
"•  Use of clean planting and grafting material and Use of certified seedlings Two sprays of streptocycline200-300ppm at 20days interval reduce fruit infection.\n•  Dipping the fruits in 200ppm solution of agrimycin-100 is effective.\n•  Mango verities like Bombay green, fazali, Jehangir and suvarnarekha are resistant."],
    "Cutting Weevil": ["Deporaus marginatus, commonly known as the mango leaf-cutting weevil, is a species of leaf weevil in the beetle family Attelabidae. It is a light tan colour with black elytra (wing cases), and is found in tropical Asia where it is a pest of mango (Mangifera indica).",
    "•  The most obvious symptom of attack by this pest is presence of young leaf bits below the tree.\n•   Stripped shoots can be easily seen on the infested plant from distance.\n•  Adult feeding produces “Windowpanes” on young leaves.\n•   Heavy clustering of weevils is observed in the apical portion of new flush.\n•   The weevils are very active and fly away quickly if any slight disturbance is there.",
    "•  When population numbers are low, plant extracts of garlic and chili dissolved in water can be sprayed to ward off caterpillars and reduce shoot borer infestation.",
    "•  Spraying of insecticides such as Deltamethrin (1 mL/L) or Cypermethrin (0.5 mL/L) or Carbaryl (4 g/L) during new leaf emergence can effectively prevent the weevil damage.\n•  Close monitoring has to be carried out during spraying as these weevils can fly away and stay on the neighbouring plants (orchards) and can return later to cause enormous damage."],
    "Die Back": ["Die back of mango is very destructive disease caused by Lasiodiplodia theobromae which is alarming mango growers of Pakistan with its characteristic symptoms as discoloration and darkening of twigs from tip to downward, withering, drying and defoliation.",
    "•  The disease is characterized by dying back of twigs from tip downwards particularly in older leaves.\n•  It is giving an appearance of scorching by fire followed by complete defoliation.\n•  Barks are discolored and darkened at certain distances from tip.\n•  Such dark patches are generally seen on young green twigs.\n•  When the dark lesion increase in size, dying of young twigs begin at the base affecting leaf mid ribs extending along the veins.\n•  The upper leaves use their healthy green color and gradually turn brown accompanied by upward rolling of leaf margin.\n•  In, advanced stage, such leaves shriveled, fall off in a month are more, leaving the shriveled twigs.\n•  Internal browning in the wood tissue is observed on the slitting along the long axis.\n•  Cracks appear on branches, which exude gum.\n•  In fruits, the pericarp darkens",
  "•  The fungus is a wound parasite. Dead twigs and bark of the trees harbor the fungus. The spores are spread through rain splashes.",
  "•  Fruits should be harvested on clear dry days.\n•  Injuries should be avoided on fruits at all stages of handling.\n•  Care should be taken to prevent snapping off of the pedicel.\n•  Dipping of mangoes in 6% solution of borax at 430c for 3min.\n•  gives effective control.\n•  Carbendazim 0.1% or theophanate-methyl, 0.1% or chlorothalonyl 0.2% spraying in the field before harvesting gives effective control."],
    "Gall Midge": ["Mango gall midge are tiny flies widespread in most mango growing areas of the world. Gall midge larvae feed within plant tissue, causing abnormal plant growth called galls that can damage to mango leaves, flowers, fruit and shoots.",
    "•  The mango gall midge or blister midge damage flowers and infested mango buds, shoots, young fruits bear and many small blister galls.\n•  Leaf gall midge is serious pest of mango; heavily infested mango trees may reduce few inflorescences resulting in reduced yield of mango fruits.\n•  Gall leaves remaining on trees are known to provide reservoirs of anthracnose inoculums.\n•  Newly emerged larvae (young ones) feed on leaves and produce small raised wart-like galls underside of leaves.\n•  The adult emerges from leaves by making holes after about a fortnight in summer season.\n•  The photosynthetic activity is reduced; affected leaves get deformed and drop prematurely, and ultimately lowered fruit yield.",
    "•  Adult mango gall midges can fly and spread naturally in localised areas from mango tree to mango tree.\n•  Their spread may be enhanced by strong winds.\n•  There are large distances between host mango trees on Cape York Peninsula which helps limit natural spread of this pest.\n•  Mango leaf gall midge can also be spread by human-assisted movement of infested plant material and in infested soil (pest carriers).",
    "•  The surviving stages of midges in fallen leaves should be collected and destroyed.\n•  Hoeing should be done under the tree canopy of mango tree followed by irrigation to kill the pupating midges in soil.\n•  After fruit harvesting pruning should be done properly and damaged branches are burned away from orchard.\n•  Plastic sheet is used to break life cycle of midge under the plant canopy to cover soil.\n•  It prevents emergence of adult from soil and also prevent dropping larvae to go into soil for pupation that results population decreases.\n•  Use of foliar application of 2 % Neem extract on affected mango trees.\n•  Use of yellow coloured card (20x20cm) with sticky material surrounded to mango tree up to 4 feet height from soil surface level from January to June.\n•  The adult will be trapped on the cards due to sticky material.\n•  Foliar application of Bifenthrin at 60-70 ml/100L of water found satisfactory results.\n•  The sprays repeated with 10 days interval during the flowering season.\n•  Soil treatments have also been used to kill carry over population of larvae in soil under mango trees, apply through drenching chlorpyrifos (e.\n• g.\n•  Lorsben 500ml/100L water) OR apply fipronil (e.g. Regent/Refree 8 kg/acre) under the canopy of trees."],
    "Healthy": ["Mango trees need a warm environment with a temperature ideally above 21°C (70°F) and a minimum temperature of 4°C (40°F). Mango trees ideally need 8 hours of sunlight per day to produce flowers and fruit. Place pot-grown mango trees outside in summer if possible, to give them sufficient sunlight.","","",""],
    "Powdery Mildew": ["Oidium mangiferae is a plant pathogen that infects mango trees causing powdery mildew. Powdery mildew of mango is an Ascomycete pathogen of the Erysiphales family that was initially described by Berthet in 1914, using samples collected from Brazil.",
    "•  A whitish powdery growth covers the stalks of the panicle, flowers and tender fruits.\n•  The whitish growth of the fungus comprising of asexual fruiting body an oidea.\n•  The affected flowers and fruits drop prematurely reducing the setting of fruits.\n•  At higher altitudes, the infection extends to the young leaves and twigs.\n•  Many of these are covered by the white powdery fungal growth and may exhibit distorted growth.\n•  On younger leaves it induces leaf curling.",
    "•  During off-season, the pathogen survives in the intact green malformed panicles mostly hidden under dense foliage and its sexual forms has not been recorded.\n•  During flowering period, the conducive environmental condition activates the dormant mycelium in necrotic leaves.\n•  Abundant conidia are produced and blown over to the new flushes through the wind on young panicles which provides spore load for initiating the disease.\n•  Fresh infection on young leaves happens during first week of the December.",
  "•  The disease can be managed by pruning of diseased leaves and malformed panicles and three sprays of fungicides at different stages starting with Wettable Sulphur (0.2%) at the panicle size of 7.50 -10.\n• 00 cm followed by Dinocap (0.1%) after 15-20 days of first spray and Tridemorph (0.1%) after15-20days of second spray.\n•  Wettable Sulphur (0.2%) can be used in all the three sprays and number of sprays may be reduced as per appearance and time of disease."],
    "Sooty Mould": ["Mango sooty mold (Meliola mangiferae) is one of the species of fungi that grow on honeydew results from interactions among sap-feeding insects such as soft scale (wax, green and cottony cushion scales), mealybugs, aphids, whiteflies and treehoppers and non-parasitic fungi.",
    "•  The fungi produce mycelium, which is usually superficial and dark.\n•  They grow on the flowers, both tender and old leaves, stems and fruits.\n•  They grow thrive on the sugary secretions of the plant hoppers.\n•  Black encrustations are formed on the surfaces of different parts of the plant.\n•  The photosynthetic ability of the plant is highly reduced.\n•  During flowering time, its attack results in reduced fruit set and cause fruit fall.\n•  Black coating is also found on the fruits.\n•  Appearance of the affected fruits is lost and the price for such ugly fruits is usually low.",
  "•  Diseased leaves serve as primary source of inoculum",
  "•  Both the insects and sooty moulds are to be simultaneously controlled in the eradication process.\n•  The insects are killed by spraying with carbaryl or phosphomidon 0.03%.\n•  It is followed by spraying with a dilute solution of starch or maida 5%.\n•  On drying, the starch comes off in flakes and the process removes the black mouldy growth fungi from different plant parts.\n•  Spraying insecticide followed by spraying with fungicide viz.\n• , Bordeaux mixture 1% is also recommended.\n•  Spraying of wettable sulphur methyl parathion+gum acacia (0.2+0.1+3%) at 15days interval reduces the sooty mould incidence."]
  }